app/controllers/products_controller.rb

  def edit
    @product = current_user.products.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = 1 AND "products"."id" = $1 LIMIT 1  [["id", "2"]]

  def create
    @product = current_user.products.create(params[:product])
---
INSERT INTO "products" ("created_at", "data", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 17 Apr 2013 10:47:57 UTC +00:00], ["data", nil], ["name", "book store"], ["updated_at", Wed, 17 Apr 2013 10:47:57 UTC +00:00], ["user_id", 1]]